app/controllers/pessoas_controller.rb

  def index
    if current_user
      @lead = client.query("select Id, FirstName, LastName, Email, Company, Title, Phone, Website from Lead")

      pessoas_aux = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("company", "created_at", "email", "integrate", "job_title", "last_name", "name", "phone", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE "pessoas" SET "website" = ?, "integrate" = ?, "updated_at" = ? WHERE "pessoas"."id" = 609  [["website", ""], ["integrate", false], ["updated_at", Wed, 13 Aug 2014 06:22:59 UTC +00:00]]

  def destroy
    @pessoa.destroy
---
DELETE FROM "pessoas" WHERE "pessoas"."id" = ?  [["id", 683]]

  def integrate_salesforce
    @pessoa.integrate = !@pessoa.integrate
    @pessoa.save
---
UPDATE "pessoas" SET "salesforce_id" = ?, "updated_at" = ? WHERE "pessoas"."id" = 742  [["salesforce_id", "00Qo0000002ZK6XEAW"], ["updated_at", Wed, 13 Aug 2014 07:39:57 UTC +00:00]]

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? LIMIT 1  [["id", "683"]]